alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// Show keyboard and let user type a password. Returns typed string in out (64 bytes).
// Uses the existing keyboard (inputBuf/inputLen/shiftOn/altOn globals).
// Tap the input bar (Send button area) to submit.
void enterPassword(const char* ssidPrompt, char* out) {
    inputBuf[0] = '\0';
    inputLen    = 0;
    moreMode    = false;
    shiftOn     = false;
    altOn       = false;
    kbVisible   = true;

    tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
    fontOff();
    tft.setTextSize(1);
    tft.setTextColor(TFT_YELLOW, COL_BG);
    tft.setCursor(0, 0);  tft.print("Password for:");
    tft.setTextColor(TFT_WHITE,  COL_BG);
    tft.setCursor(0, 10); tft.print(ssidPrompt);
    drawInputBar();
    drawKeyboard();

    while (true) {
        if (!ts.touched()) continue;
        TS_Point pt = ts.getPoint();
        while (ts.touched()) delay(5);
        int sx, sy;
        mapTouch(pt, sx, sy);

        // Input bar tap → submit
        if (sy >= IBAR_Y_KB_SHOW && sy < IBAR_Y_KB_SHOW + IBAR_H_KB_SHOW) {
            strncpy(out, inputBuf, 63); out[63] = '\0';
            inputBuf[0] = '\0'; inputLen = 0;   // clear sensitive data
            return;
        }

        // Keyboard area
        if (sy >= KB_Y) {
            int bsY = SCREEN_H - BS_H;
            // BS key
            if (inRect(sx, sy, BS_X, bsY, BS_W, BS_H)) {
                drawKey(BS_X, bsY, BS_W, BS_H, "<-", TFT_WHITE, COL_BTN_TEXT);
                delay(KEY_FLASH_MS);
                drawKey(BS_X, bsY, BS_W, BS_H, "<-", COL_BTN_BG, COL_BTN_TEXT);
                if (inputLen > 0) { inputBuf[--inputLen] = '\0'; drawInputBar(); }
                continue;
            }
            // Row 4: Shift, Alt, Space (Hide ignored during password entry)
            int row4Y = KB_Y + 4 * (KEY_H + KEY_GAP) + 1;
            if (sy >= row4Y && sy < row4Y + KEY_H - 1) {
                if (inRect(sx, sy, SHIFT_X, row4Y, SHIFT_W, KEY_H - 1)) {
                    shiftOn = !shiftOn; altOn = false; drawKeyboard();
                } else if (inRect(sx, sy, ALT_X, row4Y, ALT_W, KEY_H - 1)) {
                    altOn = !altOn; shiftOn = false; drawKeyboard();
                } else if (inRect(sx, sy, SPACE_X, row4Y, SPACE_W, KEY_H - 1)) {
                    if (inputLen < 63) {
                        inputBuf[inputLen++] = ' '; inputBuf[inputLen] = '\0';
                        drawInputBar();
                    }
                }
                continue;
            }
            // Character keys
            String typed = typeKBKey(sx, sy);
            if (typed.length() > 0) {
                int addLen = typed.length();
                if (inputLen + addLen <= 63) {
                    memcpy(inputBuf + inputLen, typed.c_str(), addLen);
                    inputLen += addLen;
                    inputBuf[inputLen] = '\0';
                    drawInputBar();
                }
            }
        }
    }
}

void sendPrompt();  // forward declaration — defined after callGemini()

void handleTouch() {
    if (!ts.touched()) return;
    if (millis() - lastTouchMs < TOUCH_DEBOUNCE_MS) {
        while (ts.touched()) delay(10);
        return;
    }

    // Sample start position; track through release to get end position for swipe
    TS_Point startPt = ts.getPoint();
    TS_Point endPt   = startPt;
    while (ts.touched()) {
        endPt = ts.getPoint();
        delay(5);
    }
    lastTouchMs = millis();

    int sx, sy;
    mapTouch(startPt, sx, sy);
    if (sx < 0 || sy < 0 || sx >= SCREEN_W || sy >= SCREEN_H) return;

    // --- History area: swipe up/down to scroll ---
    int histH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
    if (sy < histH) {
        int ex, ey;
        mapTouch(endPt, ex, ey);
        int deltaY = ey - sy;
        if (abs(deltaY) >= SWIPE_THRESHOLD) {
            int steps     = max(1, abs(deltaY) / 10);
            int lineH     = largeFont ? LINE_H_LARGE : LINE_H_SMALL;
            int maxVis    = histH / lineH;
            int maxScroll = max(0, lineCount - maxVis);
            if (deltaY > 0) {   // swipe down → older
                scrollOffset = min(scrollOffset + steps, maxScroll);
            } else {            // swipe up → newer
                scrollOffset = max(0, scrollOffset - steps);
            }
            drawHistory();
        }
        return;
    }

    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;

    // --- Input bar ---
    if (sy >= barY && sy < barY + barH) {
        // When KB is hidden, check New before Send — New sits adjacent to Send and
        // touch imprecision can cause taps aimed at New to register in the Send zone.
        if (!kbVisible && sx >= SCREEN_W - BTN_NEW_X && sx < SCREEN_W - BTN_SEND_W + 4) {
            // New button → clear history, add marker, show KB
            historyCount = 0;
            lineCount    = 0;
            scrollOffset = 0;
            moreMode     = false;
            inputBuf[0]  = '\0';
            inputLen     = 0;
            // Add [New chat] as a display-only marker (never sent to AI)
            history[historyCount].isUser      = true;
            history[historyCount].isError     = false;
            history[historyCount].displayOnly = true;
            strncpy(history[historyCount].text, "[New chat]", 2047);
            historyCount++;
            rebuildLines();
            kbVisible    = true;
            tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
            drawHistory();
            drawInputBar();
            drawKeyboard();
        } else if (sx >= SCREEN_W - BTN_SEND_W) {
            // Send/More button
            sendPrompt();
        } else if (kbVisible) {
            // Tap text area with KB shown → backspace
            if (inputLen > 0) {
                inputBuf[--inputLen] = '\0';
                if (inputLen == 0 && historyCount > 0) moreMode = true;
                drawInputBar();
            }
        } else {
            // KB hidden → show it
            kbVisible = true;
            tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
            drawHistory();
            drawInputBar();
            drawKeyboard();
        }
        return;
    }

    // --- Keyboard area ---
    if (kbVisible && sy >= KB_Y) {
        int rowStep = KEY_H + KEY_GAP;
        int row4Y   = KB_Y + 4 * rowStep + 1;

        // BS — tall key at bottom left, spans row 3/4 area
        int bsY = SCREEN_H - BS_H;
        if (inRect(sx, sy, BS_X, bsY, BS_W, BS_H)) {
            drawKey(BS_X, bsY, BS_W, BS_H, "<-", TFT_WHITE, COL_BTN_TEXT);
            delay(KEY_FLASH_MS);
            drawKey(BS_X, bsY, BS_W, BS_H, "<-", COL_BTN_BG, COL_BTN_TEXT);
            if (inputLen > 0) {
                inputBuf[--inputLen] = '\0';
                if (inputLen == 0 && historyCount > 0) moreMode = true;
                drawInputBar();
            }
            return;
        }

        // Row 4 special keys
        if (sy >= row4Y && sy < row4Y + KEY_H - 1) {
            if (inRect(sx, sy, SHIFT_X, row4Y, SHIFT_W, KEY_H - 1)) {
                shiftOn = !shiftOn;
                if (shiftOn) altOn = false;
                drawKeyboard();
            } else if (inRect(sx, sy, ALT_X, row4Y, ALT_W, KEY_H - 1)) {
                altOn = !altOn;
                if (altOn) shiftOn = false;
                drawKeyboard();
            } else if (inRect(sx, sy, SPACE_X, row4Y, SPACE_W, KEY_H - 1)) {
                drawKey(SPACE_X, row4Y, SPACE_W, KEY_H - 1, "SPACE", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(SPACE_X, row4Y, SPACE_W, KEY_H - 1, "SPACE", COL_BTN_BG, COL_BTN_TEXT);
                if (inputLen < INPUT_MAX_LEN) { moreMode = false; inputBuf[inputLen++] = ' '; inputBuf[inputLen] = '\0'; drawInputBar(); }
            } else if (inRect(sx, sy, HIDE_X, row4Y, HIDE_W, KEY_H - 1)) {
                kbVisible = false;
                tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
                drawHistory();
                drawInputBar();
            }
            return;
        }

        // Character keys (rows 0–3): numbers, letters, ,./  (shifted: <>?  alt: []\)
        String typed = typeKBKey(sx, sy);
        if (typed.length() > 0) {
            int addLen = typed.length();
            if (inputLen + addLen <= INPUT_MAX_LEN) {
                moreMode = false;
                memcpy(inputBuf + inputLen, typed.c_str(), addLen);
                inputLen += addLen;
                inputBuf[inputLen] = '\0';
                drawInputBar();
            }
        }
        return;
    }

