alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    return "ERR: no text in response";
}

String callGroq(const char* prompt) {
    // Groq: OpenAI-compatible /openai/v1/chat/completions
    JsonDocument reqDoc;
    reqDoc["model"]  = GROQ_MODEL;
    reqDoc["stream"] = false;

    JsonArray messages = reqDoc["messages"].to<JsonArray>();

    // System prompt
    JsonObject sysMsgObj = messages.add<JsonObject>();
    sysMsgObj["role"]    = "system";
    sysMsgObj["content"] = "Respond in 150 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols, no numbered or unnumbered lists. Use paragraphs to separate distinct ideas. Never include URLs, hyperlinks, citations, footnotes, source references, or attribution of any kind.";

    // Conversation history (exclude last entry — current prompt)
    for (int i = 0; i < historyCount - 1; i++) {
        if (history[i].displayOnly) continue;
        JsonObject msg  = messages.add<JsonObject>();
        msg["role"]     = history[i].isUser ? "user" : "assistant";
        msg["content"]  = history[i].text;
    }

    // Current prompt
    JsonObject curMsg  = messages.add<JsonObject>();
    curMsg["role"]     = "user";
    curMsg["content"]  = prompt;

    String body;
    serializeJson(reqDoc, body);

    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);

    showWaiting("Thinking...");  // re-assert just before blocking TLS handshake
    if (!client.connect(GROQ_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    client.printf(
        "POST /openai/v1/chat/completions HTTP/1.0\r\n"
        "Host: " GROQ_HOST "\r\n"
        "Content-Type: application/json\r\n"
        "Authorization: Bearer %s\r\n"
        "Content-Length: %d\r\n\r\n",
        GROQ_API_KEY, (int)body.length());
    client.print(body);

    String fullResp = "";
    unsigned long deadline  = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs = millis() + API_WAIT_FIRST_MS;
    while (millis() < deadline) {
        while (client.available()) {
            fullResp += (char)client.read();
        }
        if (!client.connected() && !client.available()) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 6000;
        }
        pollKBHide();
        delay(10);
    }
    client.stop();
    Serial.printf("[Groq] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Parse HTTP status
    int httpStatus = 200;
    if (fullResp.startsWith("HTTP/")) {
        int sp = fullResp.indexOf(' ');
        if (sp > 0) httpStatus = fullResp.substring(sp + 1, sp + 4).toInt();
    }

    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) return "ERR: no JSON in response";
    String respBody = fullResp.substring(jsonStart);
    Serial.println("[Groq] JSON body: " + respBody.substring(0, 400));

    if (httpStatus != 200) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: HTTP %d (see serial)", httpStatus);
        return String(buf);
    }

    JsonDocument respDoc;
    if (deserializeJson(respDoc, respBody) != DeserializationError::Ok) {
        Serial.println("Bad JSON: " + respBody.substring(0, 200));
        return "ERR: JSON parse failed";
    }

    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    // OpenAI-compatible: choices[0].message.content
    const char* text = respDoc["choices"][0]["message"]["content"];
    if (text) return String(text);

    return "ERR: no text in response";
}

// --- Send flow ---
void showThinking() {
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    tft.loadFont(DejaVuSansBold8pxData);
    tft.drawString("Thinking...", 2, barY + (barH - LINE_H_SMALL) / 2);
    tft.unloadFont();
}

void sendPrompt() {
    char prompt[128];
    if (inputLen == 0) {
        if (!moreMode) return;  // nothing typed and no AI reply yet — ignore tap
        strncpy(prompt, "Tell me more", 127);
    } else {
        strncpy(prompt, inputBuf, 127);
        inputBuf[0] = '\0';
        inputLen    = 0;
    }
    prompt[127] = '\0';
    moreMode = false;
    kbVisible = false;   // hide KB; drawHistory() covers the KB area
    drawInputBar();      // clear full bar now — erases BS/Hide key remnants before API wait

    // Show user message and thinking indicator
    addMessage(true, false, prompt);
    showThinking();

    // Call API
    String response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));

    if (response.startsWith("ERR:")) {
        addMessage(false, true, response.c_str());
    } else {
        addMessage(false, false, response.c_str());
    }

    moreMode = true;   // after every reply, offer "More"
    wifiHealthy = (WiFi.status() == WL_CONNECTED);  // refresh after API call; LED uses RSSI independently
    drawInputBar();
}

void drawCrosshair(int x, int y) {
    tft.drawLine(x - 18, y, x + 18, y, TFT_WHITE);
    tft.drawLine(x, y - 18, x, y + 18, TFT_WHITE);
    tft.drawCircle(x, y, 6, TFT_WHITE);
}

void calibrateTouch() {
    const int T1X = 20,           T1Y = 20;
    const int T2X = SCREEN_W - 20, T2Y = SCREEN_H - 20;

    tft.fillScreen(COL_BG);
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE, COL_BG);

    // Flush any spurious touches
    while (ts.touched()) delay(5);
    delay(200);

    // --- Point 1: top-left ---
    drawCrosshair(T1X, T1Y);
    tft.setCursor(60, 110); tft.print("Tap the crosshair");

    while (!ts.touched()) delay(5);
    long sumX = 0, sumY = 0; int n = 0;
    while (ts.touched()) {
        TS_Point p = ts.getPoint();
        sumX += p.x; sumY += p.y; n++;
        delay(5);
    }
    int rx1 = sumX / n, ry1 = sumY / n;

    // --- Point 2: bottom-right ---
    tft.fillScreen(COL_BG);
    drawCrosshair(T2X, T2Y);
    tft.setCursor(60, 110); tft.print("Tap the crosshair");

