alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    delay(300);
    while (!ts.touched()) delay(5);
    sumX = 0; sumY = 0; n = 0;
    while (ts.touched()) {
        TS_Point p = ts.getPoint();
        sumX += p.x; sumY += p.y; n++;
        delay(5);
    }
    int rx2 = sumX / n, ry2 = sumY / n;

    // Extrapolate raw values to screen edges (0 and SCREEN_W/H - 1)
    long dRx = rx2 - rx1, dTx = T2X - T1X;
    long dRy = ry2 - ry1, dTy = T2Y - T1Y;
    calXmin = (int)(rx1 - dRx * T1X / dTx);
    calXmax = (int)(rx2 + dRx * (SCREEN_W - 1 - T2X) / dTx);
    calYmin = (int)(ry1 - dRy * T1Y / dTy);
    calYmax = (int)(ry2 + dRy * (SCREEN_H - 1 - T2Y) / dTy);

    saveTouchCal();
    Serial.printf("[Cal] xmin=%d xmax=%d ymin=%d ymax=%d\n", calXmin, calXmax, calYmin, calYmax);

    tft.fillScreen(COL_BG);
    tft.setTextColor(TFT_GREEN, COL_BG);
    tft.setCursor(60, 110); tft.print("Calibration saved!");
    delay(1500);
}

// Slide the SLUG logo off to the right over 1 second
void slideOutSlug() {
    const int    imgX0 = SCREEN_W - SLUGSMALL_W;   // 176
    const int    imgY  = 20;
    const unsigned long dur = 1000UL;
    unsigned long t0 = millis();
    int prevX = imgX0;
    while (true) {
        unsigned long elapsed = millis() - t0;
        if (elapsed >= dur) break;
        int x = imgX0 + (int)((long)SLUGSMALL_W * elapsed / dur);
        if (x > prevX) {
            // Erase only the newly-exposed left strip (no transparent holes to worry about)
            tft.fillRect(prevX, imgY, x - prevX, SLUGSMALL_H, COL_BG);
            if (x < SCREEN_W)
                tft.pushImage(x, imgY, SLUGSMALL_W, SLUGSMALL_H, SLUG_SMALL);
            prevX = x;
        }
        delay(16);
    }
    tft.fillRect(imgX0, imgY, SLUGSMALL_W, SLUGSMALL_H, COL_BG);
}

void showModelChoices() {
    // Slug logo top-right (below the two help lines, clear of left-aligned model text)
    tft.pushImage(SCREEN_W - SLUGSMALL_W, 20, SLUGSMALL_W, SLUGSMALL_H, SLUG_SMALL);

    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE, COL_BG);
    tft.setCursor(0, 30); tft.print("Hit 1 for Gemini 2.5 Flash");
    tft.setCursor(0, 40); tft.print("    2 for Gemini 3 Flash");
    tft.setCursor(0, 50); tft.print("    3 for Gemini 3.1 Pro");
    tft.setCursor(0, 60); tft.print("    4 for Grok 4.1 Fast Reasoning");
    tft.setCursor(0, 70); tft.print("    5 for Groq GPT-OSS-120b");
    int nextY = 80;
    if (!largeFont) {
        tft.setCursor(0, nextY); tft.print("    b for bigger font");
        nextY += 10;
    }
    if (!invertDisplay) {
        tft.setCursor(0, nextY); tft.print("    i  to invert colours");
        nextY += 10;
    }
}

void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        if (!ts.touched()) continue;
        TS_Point pt = ts.getPoint();
        while (ts.touched()) delay(5);
        int sx, sy;
        mapTouch(pt, sx, sy);

        // Hit-test keys 1, 2, 3 (Gemini models)
        int x = 0;
        for (int i = 0; i < 3; i++, x += KEY_W) {
            if (inRect(sx, sy, x, KB_Y, KEY_W, KEY_H)) {
                char lbl[2] = { char('1' + i), '\0' };
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, COL_KEY_FACE, COL_KEY_LABEL);
                slideOutSlug();
                strncpy(GEMINI_MODEL, modelIds[i], 47);
                GEMINI_MODEL[47] = '\0';
                geminiUseGlobal  = modelGlobal[i];
                useGrok          = false;
                useGroq          = false;
                uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
                if (largeFont) {
                    fontOn();
                    tft.setTextColor(TFT_GREEN, bg);
                    tft.drawString("SLUG AI chatbot", 0, 0);
                    tft.drawString(GEMINI_MODEL, 0, LINE_H_LARGE);
                    tft.setTextColor(TFT_DARKGREY, bg);
                    tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                    fontOff();
                } else {
                    tft.setTextSize(1);
                    tft.setTextColor(TFT_GREEN, bg);
                    tft.setCursor(0,  0); tft.print("SLUG AI Chatbot v0.1");
                    tft.setCursor(0, 10); tft.print("Model: "); tft.print(GEMINI_MODEL);
                    tft.setTextColor(TFT_DARKGREY, bg);
                    tft.setCursor(0, 20); tft.print("Ready.");
                }
                return;
            }
        }

        // Key 4 — Grok 4.1 Fast
        int x4 = 3 * KEY_W;
        if (inRect(sx, sy, x4, KB_Y, KEY_W, KEY_H)) {
            drawKey(x4, KB_Y, KEY_W, KEY_H, "4", TFT_WHITE, COL_BG);
            delay(KEY_FLASH_MS);
            drawKey(x4, KB_Y, KEY_W, KEY_H, "4", COL_KEY_FACE, COL_KEY_LABEL);
            slideOutSlug();
            useGrok = true;
            useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI Chatbot", 0, 0);
                tft.drawString("Grok 4.1 Fast", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("SLUG AI Chatbot. Swipe down/up to scroll.");
                tft.setCursor(0, 10); tft.print("Model: Grok 4.1 Fast");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }

        // Key 5 — Groq GPT-OSS-120b
        int x5 = 4 * KEY_W;
        if (inRect(sx, sy, x5, KB_Y, KEY_W, KEY_H)) {
            drawKey(x5, KB_Y, KEY_W, KEY_H, "5", TFT_WHITE, COL_BG);
            delay(KEY_FLASH_MS);
            drawKey(x5, KB_Y, KEY_W, KEY_H, "5", COL_KEY_FACE, COL_KEY_LABEL);
            slideOutSlug();
            useGroq = true;
            useGrok = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                fontOn();
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("SLUG AI chatbot", 0, 0);
                tft.drawString("Groq GPT-OSS-120b", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                fontOff();
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("SLUG AI chatbot. Swipe down/up to scroll.");
                tft.setCursor(0, 10); tft.print("Model: Groq GPT-OSS-120b");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }

        // Key B (ZXCVBNM row, index 4) — toggle large text, re-show choices
        if (!largeFont) {
            int rowStep = KEY_H + KEY_GAP;
            int row3Y   = KB_Y + 3 * rowStep;
            int xb      = 4 * KEY_W;
            if (inRect(sx, sy, xb, row3Y, KEY_W, KEY_H)) {
                drawKey(xb, row3Y, KEY_W, KEY_H, "B", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xb, row3Y, KEY_W, KEY_H, "b", COL_KEY_FACE, COL_KEY_LABEL);
                largeFont = true;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                fontOn();
                tft.setTextColor(TFT_DARKGREY, COL_BG);
                tft.drawString("SLUG AI chatbot. Large text.", 0, 0);
                tft.drawString("Select AI model:", 0, LINE_H_LARGE);
                fontOff();
                showModelChoices();
            }
        }

        // Key I (QWERTY row, index 7) — toggle invert colours, re-show choices
        {
            int rowStep = KEY_H + KEY_GAP;
            int row1Y   = KB_Y + rowStep;
            int xi      = 7 * KEY_W;
            if (inRect(sx, sy, xi, row1Y, KEY_W, KEY_H)) {
                drawKey(xi, row1Y, KEY_W, KEY_H, "I", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xi, row1Y, KEY_W, KEY_H, "i", COL_KEY_FACE, COL_KEY_LABEL);
                invertDisplay = !invertDisplay;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                if (largeFont) {
                    fontOn();
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.drawString("SLUG AI chatbot. Large text.", 0, 0);
                    tft.drawString("Select AI model:", 0, LINE_H_LARGE);
                    fontOff();
                } else {
                    tft.setTextSize(1);
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.setCursor(0,  0); tft.print("SLUG AI chatbot");
                    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
                }
                showModelChoices();
            }
        }

        // Key C (ZXCVBNM row, index 2) — touch calibration
        {
            int rowStep = KEY_H + KEY_GAP;
            int row3Y   = KB_Y + 3 * rowStep;
            int xc      = 2 * KEY_W;
            if (inRect(sx, sy, xc, row3Y, KEY_W, KEY_H)) {
                drawKey(xc, row3Y, KEY_W, KEY_H, "C", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xc, row3Y, KEY_W, KEY_H, "c", COL_KEY_FACE, COL_KEY_LABEL);
                calibrateTouch();
                tft.fillScreen(COL_BG);
                tft.setTextSize(1);
                tft.setTextColor(TFT_DARKGREY, COL_BG);
                tft.setCursor(0,  0); tft.print("SLUG AI chatbot");
                tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
                drawKeyboard();
                drawInputBar();
                showModelChoices();
            }
        }
    }
}

void setup() {
    loadWifiCreds();   // load NVS; shows AP picker on first boot if no credentials stored
    loadTouchCal();    // load saved touch calibration from NVS (or keep defaults)

    // Hold BOOT button (GPIO0) on power-on to wipe touch calibration back to defaults
    pinMode(0, INPUT_PULLUP);
    if (digitalRead(0) == LOW) {
        Preferences p;
        p.begin("touch", false);
        p.remove("valid");
        p.remove("orient");
        p.end();
        calXmin = 200; calXmax = 3900; calYmin = 200; calYmax = 3900;
        Serial.begin(115200);
        Serial.println("[Cal] Reset to defaults via BOOT button");
        delay(500);
    }
    Serial.begin(115200);
    Serial.printf("[Cal] xmin=%d xmax=%d ymin=%d ymax=%d\n", calXmin, calXmax, calYmin, calYmax);
    waitMsgIdx = random(NUM_WAIT_MSGS);

    // Display (init before backlight to avoid white flash)
    tft.init();
#ifdef ROTATE_180
    tft.setRotation(3);
#else
    tft.setRotation(1);
#endif
    tft.fillScreen(COL_BG);

    // Backlight on after screen is ready
    pinMode(TFT_BL, OUTPUT);
    digitalWrite(TFT_BL, HIGH);

    // Touch
    touchSPI.begin(TOUCH_SCLK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS_PIN);
    ts.begin(touchSPI);
#ifdef ROTATE_180
    ts.setRotation(3);  // 180°: xraw = 4095-x, yraw = 4095-y; keeps same cal defaults (200/3900)
#else
    ts.setRotation(1);  // landscape USB-right: xraw = x, yraw = y
#endif

    // Drain spurious startup touch
    unsigned long t0 = millis();
    while (ts.touched() && millis() - t0 < 500) delay(10);

    setupRGBLed();

    // Boot splash at bottom; white area above it; "Connecting..." is the only text shown
    unsigned long splashStart = millis();
    tft.fillRect(0, 0, SCREEN_W, SCREEN_H - SLUG_H, TFT_WHITE);
    tft.pushImage(0, SCREEN_H - SLUG_H, SLUG_W, SLUG_H, SLUG_SPLASH);
    bool wifiOk = connectWiFi(wifiSsid[0], wifiPass[0], true);
    // Splash visible for at least 3 seconds
    long splashRemain = 3000L - (long)(millis() - splashStart);
    if (splashRemain > 0) delay(splashRemain);
    tft.fillScreen(COL_BG);  // clear splash; back to normal dark background

    if (!wifiOk) {
        selectAP();  // scan → pick AP → enter password → connect; returns only on success
    }

    drawKeyboard();
    drawInputBar();

    tft.setTextSize(1);
    tft.setTextColor(TFT_DARKGREY, COL_BG);
    tft.setCursor(0,  0); tft.print("SLUG AI chatbot");
    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");

    selectModel();  // draws choices at y=30+ and waits for 1/2/3
}

void checkWiFiHealth() {
    updateLedWifi();  // instant — runs every loop, LED reacts immediately to dropout

    if (millis() - lastWiFiCheckMs < 3000) return;
    lastWiFiCheckMs = millis();

    bool ok = (WiFi.status() == WL_CONNECTED) && Ping.ping(IPAddress(8,8,8,8), 1);

    if (ok != wifiHealthy) {
        wifiHealthy = ok;
        drawInputBar();  // '>' and Send/More turn red on fail, white on recovery
    }

    if (!ok) {
        // Reconnect in background — status checked on next 10s tick
        WiFi.disconnect(false);
        WiFi.begin(wifiSsid[0], wifiPass[0]);
    }
}

void loop() {
    handleTouch();
    checkWiFiHealth();
}
